thefirstrails/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "number_of_pages", "created_at", "updated_at", "detail") VALUES (?, ?, ?, ?, ?)  [["title", "abc"], ["number_of_pages", 100], ["created_at", "2023-01-31 05:57:38.495326"], ["updated_at", "2023-01-31 05:57:38.495326"], ["detail", "detail of abc book"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2023-01-27 14:15:57.341611"], ["id", 3]]