thefirstrails/app/controllers/book_reviews_controller.rb

SELECT "book_reviews".* FROM "book_reviews"
---
  def index
    @book_reviews = BookReview.all

INSERT INTO "book_reviews" ("user_id", "book_id", "review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 6], ["review", "5 sao"], ["created_at", "2023-02-04 16:41:18.353104"], ["updated_at", "2023-02-04 16:41:18.353104"]]
---
  def create
    @book_review = BookReview.new(book_review_params)
    @book_review.user_id = current_user.id

    respond_to do |format|
      if @book_review.save

SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_book_review
    @book_review = BookReview.find(params[:id])